from profile_api import *
from config import master_token

data = """52,67
62,128
55,251
57,72
87,100
40,111
70,50
75,171
82,220
42,136
83,50
78,330
76,200
51,107
65,282
68,35
26,82
58,210
50,196
61,62
46,102
91,66
88,49
34,194
35,24
43,110
33,20
45,203
66,85
31,0
28,62
72,176
64,161
69,123
54,251
29,58
90,100
77,164
60,100
44,224
79,188
67,228
63,224
71,75
25,42
59,234
41,37
30,16
53,60
47,143
36,34
73,110
48,50
27,97
39,102
49,77
32,103"""

rows = data.split('\n')
token = master_token

for row in rows:
    id, money = row.split(',')
    if not submit_gotocoins(token, id, money, "Начисление GT"):
        print(id)